codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024efh144.h
extern volatile __PORTJbits_t PORTJbits __asm__ ("PORTJ") __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJSET __attribute__((section("sfrs")));
extern volatile unsigned int        PORTJINV __attribute__((section("sfrs")));
extern volatile unsigned int        LATJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned LATJ0:1;
    unsigned LATJ1:1;
    unsigned LATJ2:1;
    unsigned LATJ3:1;
    unsigned LATJ4:1;
    unsigned LATJ5:1;
    unsigned LATJ6:1;
    unsigned LATJ7:1;
    unsigned LATJ8:1;
    unsigned LATJ9:1;
    unsigned LATJ10:1;
    unsigned LATJ11:1;
    unsigned LATJ12:1;
    unsigned LATJ13:1;
    unsigned LATJ14:1;
    unsigned LATJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __LATJbits_t;
extern volatile __LATJbits_t LATJbits __asm__ ("LATJ") __attribute__((section("sfrs")));
extern volatile unsigned int        LATJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        LATJSET __attribute__((section("sfrs")));
extern volatile unsigned int        LATJINV __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned ODCJ0:1;
    unsigned ODCJ1:1;
    unsigned ODCJ2:1;
    unsigned ODCJ3:1;
    unsigned ODCJ4:1;
    unsigned ODCJ5:1;
    unsigned ODCJ6:1;
    unsigned ODCJ7:1;
    unsigned ODCJ8:1;
    unsigned ODCJ9:1;
    unsigned ODCJ10:1;
    unsigned ODCJ11:1;
    unsigned ODCJ12:1;
    unsigned ODCJ13:1;
    unsigned ODCJ14:1;
    unsigned ODCJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __ODCJbits_t;
extern volatile __ODCJbits_t ODCJbits __asm__ ("ODCJ") __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJSET __attribute__((section("sfrs")));
extern volatile unsigned int        ODCJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPUJ0:1;
    unsigned CNPUJ1:1;
    unsigned CNPUJ2:1;
    unsigned CNPUJ3:1;
    unsigned CNPUJ4:1;
    unsigned CNPUJ5:1;
    unsigned CNPUJ6:1;
    unsigned CNPUJ7:1;
    unsigned CNPUJ8:1;
    unsigned CNPUJ9:1;
    unsigned CNPUJ10:1;
    unsigned CNPUJ11:1;
    unsigned CNPUJ12:1;
    unsigned CNPUJ13:1;
    unsigned CNPUJ14:1;
    unsigned CNPUJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPUJbits_t;
extern volatile __CNPUJbits_t CNPUJbits __asm__ ("CNPUJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPUJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNPDJ0:1;
    unsigned CNPDJ1:1;
    unsigned CNPDJ2:1;
    unsigned CNPDJ3:1;
    unsigned CNPDJ4:1;
    unsigned CNPDJ5:1;
    unsigned CNPDJ6:1;
    unsigned CNPDJ7:1;
    unsigned CNPDJ8:1;
    unsigned CNPDJ9:1;
    unsigned CNPDJ10:1;
    unsigned CNPDJ11:1;
    unsigned CNPDJ12:1;
    unsigned CNPDJ13:1;
    unsigned CNPDJ14:1;
    unsigned CNPDJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNPDJbits_t;
extern volatile __CNPDJbits_t CNPDJbits __asm__ ("CNPDJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNPDJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned :11;
    unsigned EDGEDETECT:1;
    unsigned :1;
    unsigned SIDL:1;
    unsigned :1;
    unsigned ON:1;
  };
  struct {
    unsigned w:32;
  };
} __CNCONJbits_t;
extern volatile __CNCONJbits_t CNCONJbits __asm__ ("CNCONJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNCONJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNIEJ0:1;
    unsigned CNIEJ1:1;
    unsigned CNIEJ2:1;
    unsigned CNIEJ3:1;
    unsigned CNIEJ4:1;
    unsigned CNIEJ5:1;
    unsigned CNIEJ6:1;
    unsigned CNIEJ7:1;
    unsigned CNIEJ8:1;
    unsigned CNIEJ9:1;
    unsigned CNIEJ10:1;
    unsigned CNIEJ11:1;
    unsigned CNIEJ12:1;
    unsigned CNIEJ13:1;
    unsigned CNIEJ14:1;
    unsigned CNIEJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNENJbits_t;
extern volatile __CNENJbits_t CNENJbits __asm__ ("CNENJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNENJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJ __attribute__((section("sfrs")));
typedef union {
  struct {
    unsigned CNSTATJ0:1;
    unsigned CNSTATJ1:1;
    unsigned CNSTATJ2:1;
    unsigned CNSTATJ3:1;
    unsigned CNSTATJ4:1;
    unsigned CNSTATJ5:1;
    unsigned CNSTATJ6:1;
    unsigned CNSTATJ7:1;
    unsigned CNSTATJ8:1;
    unsigned CNSTATJ9:1;
    unsigned CNSTATJ10:1;
    unsigned CNSTATJ11:1;
    unsigned CNSTATJ12:1;
    unsigned CNSTATJ13:1;
    unsigned CNSTATJ14:1;
    unsigned CNSTATJ15:1;
  };
  struct {
    unsigned w:32;
  };
} __CNSTATJbits_t;
extern volatile __CNSTATJbits_t CNSTATJbits __asm__ ("CNSTATJ") __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJCLR __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJSET __attribute__((section("sfrs")));
extern volatile unsigned int        CNSTATJINV __attribute__((section("sfrs")));
extern volatile unsigned int        CNNEJ __attribute__((section("sfrs")));
typedef struct {
  unsigned CNNEJ0:1;
  unsigned CNNEJ1:1;
  unsigned CNNEJ2:1;
  unsigned CNNEJ3:1;
  unsigned CNNEJ4:1;
  unsigned CNNEJ5:1;
  unsigned CNNEJ6:1;
  unsigned CNNEJ7:1;
  unsigned CNNEJ8:1;
  unsigned CNNEJ9:1;
  unsigned CNNEJ10:1;
  unsigned CNNEJ11:1;
  unsigned CNNEJ12:1;
  unsigned CNNEJ13:1;
  unsigned CNNEJ14:1;
  unsigned CNNEJ15:1;
} __CNNEJbits_t;
